{
  "format": "graph-model",
  "generatedBy": "1.14.0",
  "convertedBy": "TensorFlow.js Converter v1.2.6",
  "modelTopology": {
    "node": [
      {
        "name": "unused_control_flow_input_9",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_BOOL"
          }
        }
      },
      {
        "name": "unused_control_flow_input_8",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_7",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "unused_control_flow_input_6",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_BOOL"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_5",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_BOOL"
          }
        }
      },
      {
        "name": "unused_control_flow_input_4",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_BOOL"
          }
        }
      },
      {
        "name": "unused_control_flow_input_30",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "unused_control_flow_input_3",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "unused_control_flow_input_29",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_BOOL"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_28",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unused_control_flow_input_27",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_BOOL"
          }
        }
      },
      {
        "name": "unused_control_flow_input_26",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_25",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_BOOL"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_24",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "unused_control_flow_input_23",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "unused_control_flow_input_22",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_BOOL"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_21",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_20",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unused_control_flow_input_2",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_19",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_18",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_BOOL"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_17",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "1"
                }
              ]
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "unused_control_flow_input_16",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_15",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_14",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_13",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_12",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "unused_control_flow_input_11",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {}
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "unused_control_flow_input_10",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input_1",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "unused_control_flow_input",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "target_sequence_length",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "source_sequence_length",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "rnn/concat",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "3"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "decode_1/decoder/TensorArrayStack/range/start",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "decode_1/decoder/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rnn/TensorArrayUnstack/strided_slice/stack",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "Placeholder_2",
        "op": "Placeholder",
        "attr": {
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "1"
                }
              ]
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode_1/decoder/Tile/input",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_BOOL"
          },
          "value": {
            "tensor": {
              "dtype": "DT_BOOL",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "decode/decoder/dense/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode/decoder/dense/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_1/gru_cell/gates/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_1/gru_cell/gates/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "Placeholder",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "-1"
                },
                {
                  "size": "257"
                }
              ]
            }
          }
        }
      },
      {
        "name": "decode_1/decoder/TensorArrayStack/range/delta",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {}
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_0/gru_cell/gates/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_0/gru_cell/gates/kernel",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_0/gru_cell/candidate/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_0/gru_cell/candidate/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode_1/decoder/zeros/Const",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {}
            }
          }
        }
      },
      {
        "name": "rnn/MultiRNNCellZeroState/GRUCellZeroState/Const",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_0/gru_cell/gates/bias",
        "op": "Const",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_0/gru_cell/gates/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "258"
                  },
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_1/gru_cell/gates/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_1/gru_cell/gates/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_1/gru_cell/candidate/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "257"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/multi_rnn_cell/cell_1/gru_cell/candidate/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "257"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/MultiRNNCellZeroState/GRUCellZeroState_1/Const",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_0/gru_cell/candidate/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "257"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_0/gru_cell/candidate/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "258"
                  },
                  {
                    "size": "257"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_1/gru_cell/candidate/bias",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "decode/decoder/multi_rnn_cell/cell_1/gru_cell/candidate/kernel",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "Placeholder_7",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "Placeholder_6",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {}
          }
        }
      },
      {
        "name": "Placeholder_5",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "-1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Placeholder_4",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_INT32"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Placeholder_3",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "1"
                },
                {
                  "size": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "Placeholder_1",
        "op": "Placeholder",
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "-1"
                },
                {
                  "size": "1"
                }
              ]
            }
          }
        }
      },
      {
        "name": "add",
        "op": "Add",
        "input": [
          "decode_1/decoder/TensorArrayStack/range/start",
          "source_sequence_length"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "decode_1/decoder/while/Enter",
        "op": "Enter",
        "input": [
          "decode_1/decoder/TensorArrayStack/range/start"
        ],
        "attr": {
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          },
          "T": {
            "type": "DT_INT32"
          },
          "is_constant": {
            "b": false
          }
        }
      },
      {
        "name": "rnn/while/Enter",
        "op": "Enter",
        "input": [
          "decode_1/decoder/TensorArrayStack/range/start"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          },
          "is_constant": {
            "b": false
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "rnn/while/Enter_1",
        "op": "Enter",
        "input": [
          "decode_1/decoder/TensorArrayStack/range/start"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          },
          "is_constant": {
            "b": false
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "decode_1/decoder/while/Enter_1",
        "op": "Enter",
        "input": [
          "decode_1/decoder/TensorArrayStack/range/start"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          },
          "is_constant": {
            "b": false
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode_1/decoder/TensorArray",
        "op": "TensorArrayV3",
        "input": [
          "decode_1/decoder/TensorArrayStack/range/start"
        ],
        "attr": {
          "tensor_array_name": {
            "s": ""
          },
          "dtype": {
            "type": "DT_FLOAT"
          },
          "element_shape": {
            "shape": {
              "dim": [
                {
                  "size": "-1"
                },
                {
                  "size": "1"
                }
              ]
            }
          },
          "dynamic_size": {
            "b": true
          },
          "clear_after_read": {
            "b": true
          },
          "identical_element_shapes": {
            "b": true
          }
        }
      },
      {
        "name": "max_target_len",
        "op": "Max",
        "input": [
          "target_sequence_length",
          "rnn/TensorArrayUnstack/strided_slice/stack"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          },
          "Tidx": {
            "type": "DT_INT32"
          },
          "keep_dims": {
            "b": false
          }
        }
      },
      {
        "name": "decode_1/Shape",
        "op": "Shape",
        "input": [
          "Placeholder_2"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "out_type": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "decode_1/decoder/while/Enter_6",
        "op": "Enter",
        "input": [
          "Placeholder_2"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": false
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/dense/BiasAdd_1/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/dense/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/dense/MatMul_1/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/dense/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_1/gru_cell/BiasAdd_2/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_1/gru_cell/gates/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_1/gru_cell/MatMul_2/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_1/gru_cell/gates/kernel"
        ],
        "attr": {
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          }
        }
      },
      {
        "name": "rnn/transpose",
        "op": "Transpose",
        "input": [
          "Placeholder",
          "rnn/concat"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "Tperm": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/BiasAdd/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_0/gru_cell/gates/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/MatMul/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_0/gru_cell/gates/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/BiasAdd_1/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_0/gru_cell/candidate/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/MatMul_1/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_0/gru_cell/candidate/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_0/gru_cell/BiasAdd_2/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_0/gru_cell/gates/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_0/gru_cell/MatMul_2/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_0/gru_cell/gates/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_1/gru_cell/BiasAdd/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_1/gru_cell/gates/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_1/gru_cell/MatMul/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_1/gru_cell/gates/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_1/gru_cell/BiasAdd_1/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_1/gru_cell/candidate/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "rnn/while/rnn/multi_rnn_cell/cell_1/gru_cell/MatMul_1/Enter",
        "op": "Enter",
        "input": [
          "rnn/multi_rnn_cell/cell_1/gru_cell/candidate/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "cm5uL3doaWxlL3doaWxlX2NvbnRleHQ="
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_0/gru_cell/BiasAdd_3/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_0/gru_cell/candidate/bias"
        ],
        "attr": {
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_0/gru_cell/MatMul_3/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_0/gru_cell/candidate/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_1/gru_cell/BiasAdd_3/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_1/gru_cell/candidate/bias"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_1/gru_cell/MatMul_3/Enter",
        "op": "Enter",
        "input": [
          "decode/decoder/multi_rnn_cell/cell_1/gru_cell/candidate/kernel"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": true
          },
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          }
        }
      },
      {
        "name": "decode_1/decoder/while/Merge",
        "op": "Merge",
        "input": [
          "decode_1/decoder/while/Enter",
          "decode_1/decoder/while/NextIteration"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          },
          "N": {
            "i": "2"
          }
        }
      },
      {
        "name": "rnn/while/Merge",
        "op": "Merge",
        "input": [
          "rnn/while/Enter",
          "rnn/while/NextIteration"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          },
          "N": {
            "i": "2"
          }
        }
      },
      {
        "name": "rnn/while/Merge_1",
        "op": "Merge",
        "input": [
          "rnn/while/Enter_1",
          "rnn/while/NextIteration_1"
        ],
        "attr": {
          "N": {
            "i": "2"
          },
          "T": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "decode_1/decoder/while/Merge_1",
        "op": "Merge",
        "input": [
          "decode_1/decoder/while/Enter_1",
          "decode_1/decoder/while/NextIteration_1"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          },
          "N": {
            "i": "2"
          }
        }
      },
      {
        "name": "decode_1/decoder/while/TensorArrayWrite/TensorArrayWriteV3/Enter",
        "op": "Enter",
        "input": [
          "decode_1/decoder/TensorArray"
        ],
        "attr": {
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          },
          "T": {
            "type": "DT_RESOURCE"
          },
          "is_constant": {
            "b": true
          }
        }
      },
      {
        "name": "decode_1/decoder/while/Enter_2",
        "op": "Enter",
        "input": [
          "decode_1/decoder/TensorArray:1"
        ],
        "attr": {
          "parallel_iterations": {
            "i": "32"
          },
          "frame_name": {
            "s": "ZGVjb2RlXzEvZGVjb2Rlci93aGlsZS93aGlsZV9jb250ZXh0"
          },
          "T": {
            "type": "DT_FLOAT"
          },
          "is_constant": {
            "b": false
          }
        }
      },
      {
        "name": "add_2",
        "op": "Add",
        "input": [
          "decode_1/decoder/TensorArrayStack/range/start",
          "max_target_len"
        ],
        "attr": {
          "T": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "decode_1/strided_slice",
        "op": "StridedSlice",
        "input": [
          "decode_1/Shape",
          "rnn/TensorArrayUnstack/strided_slice/stack",
          "decode_1/decoder/Const",
          "decode_1/decoder/Const"
        ],
        "attr": {
          "ellipsis_mask": {
            "i": "0"
          },
          "begin_mask": {
            "i": "0"
          },
          "new_axis_mask": {
            "i": "0"
          },
          "end_mask": {
            "i": "0"
          },
          "T": {
            "type": "DT_INT32"
          },
          "Index": {
            "type": "DT_INT32"
          },
          "shrink_axis_mask": {
            "i": "1"
          }
        }
      },
      {
        "name": "decode_1/decoder/while/Merge_6",
        "op": "Merge",
        "input": [
          "decode_1/decoder/while/Enter_6",
          "decode_1/decoder/while/NextIteration_6"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "N": {
            "i": "2"
          }
        }
      },
      {
        "name": "ConstantFolding/decode/decoder/dense/bias_enter",
        "op": "Const",
        "input": [
          "^decode/decoder/while/BasicDecoderStep/dense/BiasAdd_1/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "ConstantFolding/decode/decoder/dense/kernel_enter",
        "op": "Const",
        "input": [
          "^decode/decoder/while/BasicDecoderStep/dense/MatMul_1/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  },
                  {
                    "size": "1"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "ConstantFolding/decode/decoder/multi_rnn_cell/cell_1/gru_cell/gates/bias_enter",
        "op": "Const",
        "input": [
          "^decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_1/gru_cell/BiasAdd_2/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "ConstantFolding/decode/decoder/multi_rnn_cell/cell_1/gru_cell/gates/kernel_enter",
        "op": "Const",
        "input": [
          "^decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_1/gru_cell/MatMul_2/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "rnn/TensorArrayUnstack/Shape",
        "op": "Shape",
        "input": [
          "rnn/transpose"
        ],
        "attr": {
          "T": {
            "type": "DT_FLOAT"
          },
          "out_type": {
            "type": "DT_INT32"
          }
        }
      },
      {
        "name": "ConstantFolding/rnn/multi_rnn_cell/cell_0/gru_cell/gates/bias_enter",
        "op": "Const",
        "input": [
          "^rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/BiasAdd/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "ConstantFolding/rnn/multi_rnn_cell/cell_0/gru_cell/gates/kernel_enter",
        "op": "Const",
        "input": [
          "^rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/MatMul/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "1028"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "ConstantFolding/rnn/multi_rnn_cell/cell_0/gru_cell/candidate/bias_enter",
        "op": "Const",
        "input": [
          "^rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/BiasAdd_1/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "ConstantFolding/rnn/multi_rnn_cell/cell_0/gru_cell/candidate/kernel_enter",
        "op": "Const",
        "input": [
          "^rnn/while/rnn/multi_rnn_cell/cell_0/gru_cell/MatMul_1/Enter"
        ],
        "attr": {
          "dtype": {
            "type": "DT_FLOAT"
          },
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "771"
                  },
                  {
                    "size": "514"
                  }
                ]
              }
            }
          }
        }
      },
      {
        "name": "ConstantFolding/decode/decoder/multi_rnn_cell/cell_0/gru_cell/gates/bias_enter",
        "op": "Const",
        "input": [
          "^decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_0/gru_cell/BiasAdd_2/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
        "name": "ConstantFolding/decode/decoder/multi_rnn_cell/cell_0/gru_cell/gates/kernel_enter",
        "op": "Const",
        "input": [
          "^decode/decoder/while/BasicDecoderStep/decoder/multi_rnn_cell/cell_0/gru_cell/MatMul_2/Enter"
        ],
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  {
                    "size": "258"
                  },
                  {
                    "size": "514"
                  }
                ]
              }
            }
          },
          "dtype": {
            "type": "DT_FLOAT"
          }
        }
      },
      {
